#priblem 1
# a = 4**5
# b = 512+512
# print(a>b) сначала пишем знак больше а потом только равно

# a = 17925
# b = 4394*4
# print(a > b)

# num1 = 37+59
# num2 = num1 * 12
# num3 = num2 **2
# num4 = 193432 - num3 
# print ( num4)

# a = 12
# b = 10
# c =22

# num1 = (7%3)*4.8
# print(num1)

# print(3**3 != 3//19)

# ему равен пример 
# -21//10
# Почему именно этот ответ?

# print(-21//10)


# PROBLEM 9:
# Создать 2 переменные.
# В первой год вашего рождения, Во второй 
# 2021 год 
# посчитайте сколько лет вам должно быть через 2 года/и сколько лет вам было два года назад



# num1 = 2003
# num2 = 2023
# num3 = 2
# print (num2 - num1 -num3)
 
# Найдите, какой процент этого столетия мы прожили:
# формула расчета процентов
# (a/b)*100
# где a-прожитые года
# b-сколько нужно(тк. это столетие, 
# b-100)

# a = 23 
# b = 77
# c = b - a 
# d = c + 2 
# e = c -2 
# print (d)
# print(e)



# year = 2023 - 2003

# total_year = 100

# print((year / total_year)*100)


# Найдите средне арифмитическое чисел:25, 75, 10, 95. 

# print ((25+75+10+95)/4)


# Создать 3 переменные в которых лежат 3 одинаковых числа с плавающей точкой


# a = 5.25 
# b = 5.25
# c =5.25
# d = (a+b)*c 
# print (b)

# Создать 5 переменных:
# a.Чётное число
# b.Любое от 5 до 15
# c.Дробное число до 20
# d.Любое нечётное число
# e.Любое число

# a = 6 
# b = 10
# c = 11.26
# d = 9
# e = 28
# print (a - e **(b/d)%c)



# a = ['Oleg', 'aleksador', 'sergey']
# for itemin in a :
#     print(itemin)